/* automatically generated by rust-bindgen 0.55.1 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 32;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LDOUBLE_REDIRECTS_TO_FLOAT128_ABI: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C2X: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __KERNEL_OLD_TIMEVAL_MATCHES_TIMEVAL64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Logger {
    _unused: [u8; 0],
}
pub type Logger_t = Logger;
extern "C" {
    pub fn get_tensorrt_version(string: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn create_logger(severity: ::std::os::raw::c_int) -> *mut Logger_t;
}
extern "C" {
    pub fn set_logger_severity(logger: *const Logger_t, severity: ::std::os::raw::c_int);
}
extern "C" {
    pub fn log_error(logger: *mut Logger_t, err: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn delete_logger(logger: *mut Logger_t);
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Context {
    _unused: [u8; 0],
}
pub type Context_t = Context;
extern "C" {
    pub fn destroy_excecution_context(execution_context: *mut Context_t);
}
extern "C" {
    pub fn context_set_name(execution_context: *mut Context_t, name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn context_get_name(execution_context: *mut Context_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn execute(
        execution_context: *const Context_t,
        binding_data: *mut *const ::std::os::raw::c_void,
        num_bindings: ::std::os::raw::c_int,
        data_sizes: *const usize,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HostMemory {
    _unused: [u8; 0],
}
pub type HostMemory_t = HostMemory;
extern "C" {
    pub fn destroy_host_memory(host_memory: *mut HostMemory_t);
}
extern "C" {
    pub fn host_memory_get_data(host_memory: *mut HostMemory_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn host_memory_get_size(host_memory: *mut HostMemory_t) -> usize;
}
pub const DimensionType_kSPATIAL: DimensionType = 0;
pub const DimensionType_kCHANNEL: DimensionType = 1;
pub const DimensionType_kINDEX: DimensionType = 2;
pub const DimensionType_kSEQUENCE: DimensionType = 3;
pub type DimensionType = ::std::os::raw::c_uint;
pub use self::DimensionType as DimensionType_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Dims {
    pub nbDims: ::std::os::raw::c_int,
    pub d: [::std::os::raw::c_int; 8usize],
    pub type_: [DimensionType_t; 8usize],
}
#[test]
fn bindgen_test_layout_Dims() {
    assert_eq!(
        ::std::mem::size_of::<Dims>(),
        68usize,
        concat!("Size of: ", stringify!(Dims))
    );
    assert_eq!(
        ::std::mem::align_of::<Dims>(),
        4usize,
        concat!("Alignment of ", stringify!(Dims))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Dims>())).nbDims as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Dims),
            "::",
            stringify!(nbDims)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Dims>())).d as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Dims), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Dims>())).type_ as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Dims),
            "::",
            stringify!(type_)
        )
    );
}
pub type Dims_t = Dims;
extern "C" {
    pub fn create_dims(
        nb_dims: ::std::os::raw::c_int,
        d: *const ::std::os::raw::c_int,
        dimension_types: *const DimensionType_t,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn create_dims2(dim1: ::std::os::raw::c_int, dim2: ::std::os::raw::c_int) -> *mut Dims_t;
}
extern "C" {
    pub fn create_dimsHW(
        height: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn dims2_set_dimension_types(
        dims2: *mut Dims_t,
        type1: DimensionType_t,
        type2: DimensionType_t,
    );
}
extern "C" {
    pub fn create_dims3(
        dim1: ::std::os::raw::c_int,
        dim2: ::std::os::raw::c_int,
        dim3: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn create_dimsCHW(
        channel: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn dims3_set_dimension_types(
        dims3: *mut Dims_t,
        type1: DimensionType_t,
        type2: DimensionType_t,
        type3: DimensionType_t,
    );
}
extern "C" {
    pub fn create_dims4(
        dim1: ::std::os::raw::c_int,
        dim2: ::std::os::raw::c_int,
        dim3: ::std::os::raw::c_int,
        dim4: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn create_dimsNCHW(
        index: ::std::os::raw::c_int,
        channel: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn dims4_set_dimension_types(
        dims4: *mut Dims_t,
        type1: DimensionType_t,
        type2: DimensionType_t,
        type3: DimensionType_t,
        type4: DimensionType_t,
    );
}
extern "C" {
    pub fn destroy_dims(dims: *mut Dims_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Engine {
    _unused: [u8; 0],
}
pub type Engine_t = Engine;
extern "C" {
    pub fn destroy_cuda_engine(engine: *mut Engine_t);
}
extern "C" {
    pub fn engine_create_execution_context(engine: *mut Engine_t) -> *mut Context_t;
}
extern "C" {
    pub fn get_nb_bindings(engine: *mut Engine_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn get_binding_name(
        engine: *mut Engine_t,
        binding_index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn get_binding_index(
        engine: *mut Engine_t,
        op_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn get_binding_dimensions(
        engine: *mut Engine_t,
        binding_index: ::std::os::raw::c_int,
    ) -> *mut Dims_t;
}
extern "C" {
    pub fn engine_serialize(engine: *mut Engine_t) -> *mut HostMemory_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Runtime {
    _unused: [u8; 0],
}
pub type Runtime_t = Runtime;
extern "C" {
    pub fn create_infer_runtime(logger: *mut Logger_t) -> *mut Runtime_t;
}
extern "C" {
    pub fn deserialize_cuda_engine(
        runtime: *mut Runtime_t,
        blob: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_ulonglong,
    ) -> *mut Engine_t;
}
extern "C" {
    pub fn destroy_infer_runtime(runtime: *mut Runtime_t);
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Network {
    _unused: [u8; 0],
}
pub type Network_t = Network;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tensor {
    _unused: [u8; 0],
}
pub type Tensor_t = Tensor;
extern "C" {
    pub fn destroy_network(network: *mut Network_t);
}
extern "C" {
    pub fn network_get_input(network: *mut Network_t, idx: i32) -> *mut Tensor_t;
}
extern "C" {
    pub fn tensor_set_dimensions(tensor: *mut Tensor_t, dimensions: *mut Dims_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UffParser {
    _unused: [u8; 0],
}
pub type UffParser_t = UffParser;
extern "C" {
    pub fn uffparser_create_uff_parser() -> *mut UffParser_t;
}
extern "C" {
    pub fn uffparser_destroy_uff_parser(uff_parser: *mut UffParser_t);
}
extern "C" {
    pub fn uffparser_register_input(
        uff_parser: *const UffParser_t,
        input_name: *const ::std::os::raw::c_char,
        dims: *const Dims_t,
        input_order: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    pub fn uffparser_register_output(
        uff_parser: *const UffParser_t,
        output_name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn uffparser_parse(
        uff_parser: *const UffParser_t,
        file: *const ::std::os::raw::c_char,
        network: *const Network_t,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OnnxParser {
    _unused: [u8; 0],
}
pub type OnnxParser_t = OnnxParser;
extern "C" {
    pub fn onnxparser_create_parser(
        network: *const Network_t,
        logger: *mut Logger_t,
    ) -> *mut OnnxParser_t;
}
extern "C" {
    pub fn onnxparser_destroy_parser(onnx_parser: *mut OnnxParser_t);
}
extern "C" {
    pub fn onnxparser_parse_from_file(
        onnx_parser: *const OnnxParser_t,
        file: *const ::std::os::raw::c_char,
        verbosity: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Builder {
    _unused: [u8; 0],
}
pub type Builder_t = Builder;
extern "C" {
    pub fn create_infer_builder(logger: *mut Logger_t) -> *mut Builder_t;
}
extern "C" {
    pub fn destroy_builder(builder: *mut Builder_t);
}
extern "C" {
    pub fn builder_set_max_batch_size(builder: *mut Builder_t, batch_size: i32);
}
extern "C" {
    pub fn builder_get_max_batch_size(builder: *mut Builder_t) -> i32;
}
extern "C" {
    pub fn builder_set_max_workspace_size(builder: *mut Builder_t, batch_size: usize);
}
extern "C" {
    pub fn builder_get_max_workspace_size(builder: *mut Builder_t) -> usize;
}
extern "C" {
    pub fn create_network(builder: *mut Builder_t) -> *mut Network_t;
}
extern "C" {
    pub fn create_network_v2(builder: *mut Builder_t, flags: u32) -> *mut Network_t;
}
extern "C" {
    pub fn build_cuda_engine(builder: *mut Builder_t, network: *mut Network_t) -> *mut Engine_t;
}
